package main

import "fmt"

/*
给出一个 32 位的有符号整数，你需要将这个整数中每位上的数字进行反转。

示例 1:

输入: 123
输出: 321
 示例 2:

输入: -123
输出: -321
示例 3:

输入: 120
输出: 21

来源：力扣（LeetCode）
链接：https://leetcode-cn.com/problems/reverse-integer
著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。


解题思路：
//题目简单。

时间效率O()
空间效率O()
总结：
*/

//思路1-------------------------------------------

func reverse(x int) int {
	//if x>((1<<31)-1) || x<(-(1<<31)){
	//	return 0
	//}
	y := 0
	for x != 0 {
		y = 10*y + x%10
		x = x / 10
	}
	if y > (1<<31)-1 || y < (-(1 << 31)) {
		return 0
	}
	return y
}

//他人优秀代码----------------------------------

//主函数-------------------------------------------

func main() {
	fmt.Println(reverse(1563847412))
}
